Repository: getamano/angular-18-multi-language-app-example
Catalog: src/locale/messages.*.xlf
Languages: am

# welcomeID
source: Hello, Welcome!
am: ሰላም, እንኳን ደህና መጣህ!

source: /en/home
am: /am/home

source: Home
am: ቤት

source: Home
am: ቤት

source: /en/portfolio
am: /am/portfolio

source: My Portfolio
am: የእኔ ፖርትፎሊዮ

source: Portfolio
am: ፖርትፎሊዮ

source: Copyright 2024
am: የቅጂ መብት 2024

source: Created By this.name
am: የተፈጠረ this.name

source: Gender: {genderCode, select, 0 {male} 1 {female}}
am: ጾታ: {genderCode, select, 0 {male} 1 {female}}

source: {VAR_SELECT, select, 0 {male} 1 {female}}
am: {VAR_SELECT, select, 0 {ወንድ} 1 {ሴት}}

source: Hello, my name is Aman. I'm Application Developer. <br /> Thank you for coming here!
am: ሰላም አማን እባላለሁ። እኔ መተግበሪያ ገንቢ ነኝ። <br /> እዚህ በመምጣትዎ እናመሰግናለን!
